Revit 2027 API
CoordinationModelLinkData.FileSize Property
 The size (in Megabytes) of the local nwc or .nwd file defining the Coordination Model link.
 For a Coordination Model from Autodesk Docs, size is empty.
 For a local Coordination Model, fileSize is the size (in Megabytes) of nwc or .nwd file.
Namespace: Autodesk.Revit.DB.ExternalData
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double FileSize { get; }
Public ReadOnly Property FileSize As Double
	Get
public:
property double FileSize {
	double get ();
}
member FileSize : float with get
Property Value
Double
See Also
Reference
CoordinationModelLinkData Class
Autodesk.Revit.DB.ExternalData Namespace